&НаКлиенте
Процедура ВывестиПрогрессВыполнения(Результат, ДополнительныеПараметры) Экспорт
	
	//ОткрытьФорму("ВнешняяОбработка.ВнешняяОбработка_Т_Фон.Форма.Прогресс",,,,,,,
	//РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	Попытка
		
		Прогресс_Статус = ПроверитьПрогресс(Результат.ИдентификаторЗадания);
		
		
		Объект.Статус = Прогресс_Статус.Текст;
		Если Объект.Прогресс < Прогресс_Статус.Процент Тогда
			
			Объект.Прогресс = Прогресс_Статус.Процент;
			
		КонецЕсли;
		
	Исключение
		
		Инфо = ИнформацияОбОшибке();
		Сообщить("Описание='" + Инфо.Описание + "'");
		Сообщить("ИмяМодуля='" + Инфо.ИмяМодуля + "'");
		Сообщить("НомерСтроки=" + Инфо.НомерСтроки);
		Сообщить("ИсходнаяСтрока='" + Инфо.ИсходнаяСтрока + "'");	
		
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьПрогресс(ИдентификаторЗадания)
	
	РезультатВыполнения = Новый Структура();
	РезультатВыполнения.Вставить("ЗаданиеВыполнено",    Ложь);
	РезультатВыполнения.Вставить("Процент",             0);
	РезультатВыполнения.Вставить("Текст", "");
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		РезультатВыполнения.ЗаданиеВыполнено     = Истина;
		РезультатВыполнения.Процент              = 100;
		РезультатВыполнения.Текст 				 = "Обработка успешно завершена!";	 
	Иначе
		Если ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания) Тогда
			РезультатВыполнения.ЗаданиеВыполнено= Истина;
			РезультатВыполнения.Процент         = 100;
			РезультатВыполнения.Текст 			= "Обработка успешно завершена!";
		Иначе
			ПередаваемоеЗначение = ДлительныеОперации.ПрочитатьПрогресс(ИдентификаторЗадания); // ПрочитатьПрогресс
			Если ТипЗнч(ПередаваемоеЗначение) = Тип("Структура")
				И ПередаваемоеЗначение.Свойство("Процент") Тогда
				РезультатВыполнения.Процент     = ПередаваемоеЗначение.Процент;
				РезультатВыполнения.Текст       = ПередаваемоеЗначение.Текст;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатВыполнения;	
	
КонецФункции // ()
