&НаСервере
Процедура Выполнить_ТНаСервере(ДанныеФормы, ДопПараметры) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Партнер", ДанныеФормы.Партнер);
	Запрос.УстановитьПараметр("Организация", ДанныеФормы.Организация);
	Запрос.УстановитьПараметр("Соглашение", ДанныеФормы.Соглашение);
	Запрос.Текст = "ВЫБРАТЬ
	|	ПриобретениеТоваровУслуг.Ссылка КАК Ссылка,
	|	ПриобретениеТоваровУслуг.Дата КАК Дата,
	|	ПриобретениеТоваровУслуг.Проведен КАК Проведен
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
	|ГДЕ
	|	ПриобретениеТоваровУслуг.Проведен
	|	И ПриобретениеТоваровУслуг.Партнер = &Партнер
	|	И ПриобретениеТоваровУслуг.Организация = &Организация
	|	И ПриобретениеТоваровУслуг.Соглашение = &Соглашение";
	
	Результат = Запрос.Выполнить().Выгрузить();
	ВсегоДокументов = Результат.Количество();
	
	ТекДок = 0;
	
	Для каждого Док Из Результат Цикл
		
		ДокОбъект = Док.Ссылка.ПолучитьОбъект();
		ДокОбъект.РегистрироватьЦеныПоставщика = Истина;
		
		ВсегоТоваровВДоке = ДокОбъект.Товары.Количество();
		ТекТовар = 1;
		
		Для каждого Товар Из ДокОбъект.Товары Цикл
			
			Товар.ВидЦеныПоставщика = ДанныеФормы.Соглашение.ВидЦеныПоставщика;	
			
			ПроцентВыполнения = (ТекДок/ВсегоДокументов)*100 + (ТекТовар/ВсегоТоваровВДоке);
			ПроцентВыполнения = Окр(ПроцентВыполнения, 0);
			
			ДлительныеОперации.СообщитьПрогресс(ПроцентВыполнения, СокрЛП(Строка(Док.Ссылка) + " - " + Строка(Товар)));
			
			ТекТовар = ТекТовар + 1;
			
		КонецЦикла;
		
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		
		ТекДок = ТекДок + 1;
		
	КонецЦикла; 
	
	
КонецПроцедуры
