&НаСервере
Процедура Выполнить_ТНаСервере(ДанныеФормы, ДопПараметры) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Партнер", ДанныеФормы.Партнер);
	Запрос.УстановитьПараметр("Организация", ДанныеФормы.Организация);
	Запрос.УстановитьПараметр("Соглашение", ДанныеФормы.Соглашение);
	Запрос.Текст = "ВЫБРАТЬ
	|	ПриобретениеТоваровУслуг.Ссылка КАК Ссылка,
	|	ПриобретениеТоваровУслуг.Дата КАК Дата,
	|	ПриобретениеТоваровУслуг.Проведен КАК Проведен
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
	|ГДЕ
	|	ПриобретениеТоваровУслуг.Проведен
	|	И ПриобретениеТоваровУслуг.Партнер = &Партнер
	|	И ПриобретениеТоваровУслуг.Организация = &Организация
	|	И ПриобретениеТоваровУслуг.Соглашение = &Соглашение";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокОбъект.РегистрироватьЦеныПоставщика = Истина;
		Для каждого СтрокаТЧ Из ДокОбъект.Товары Цикл
			
			//СтрокаТЧ.ВидЦеныПоставщика = ДанныеФормы.Соглашение.ВидЦеныПоставщика;	
			
		КонецЦикла;
		
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		Сообщить("Документ " + Строка(ДокОбъект.Ссылка) + " был успешно проведен!");
		
	КонецЦикла; 		
	
КонецПроцедуры
